app/controllers/profesores_controller.rb

SELECT "profesores".* FROM "profesores"
---
  def index
    @profesores = Profesore.all

INSERT INTO "profesores" ("nombre", "disciplina", "titulo", "fecha_nac", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @profesore = Profesore.new(profesore_params)

    respond_to do |format|
      if @profesore.save

SELECT  "profesores".* FROM "profesores" WHERE "profesores"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_profesore
      @profesore = Profesore.find(params[:id])